dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxMcdslight_reg.h
/** \brief 2440, Comparator Bound Register 4 */
#define MCDSLIGHT_TCXEA4_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEA_BND*)0xFA012440u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXEA4_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXEA4_BND.
*/
#define MCDSLIGHT_TCXEABND4 (MCDSLIGHT_TCXEA4_BND)

/** \brief 2444, Comparator Range Register 4 */
#define MCDSLIGHT_TCXEA4_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEA_RNG*)0xFA012444u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXEA4_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXEA4_RNG.
*/
#define MCDSLIGHT_TCXEARNG4 (MCDSLIGHT_TCXEA4_RNG)

/** \brief 2450, Comparator Bound Register 5 */
#define MCDSLIGHT_TCXEA5_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEA_BND*)0xFA012450u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXEA5_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXEA5_BND.
*/
#define MCDSLIGHT_TCXEABND5 (MCDSLIGHT_TCXEA5_BND)

/** \brief 2454, Comparator Range Register 5 */
#define MCDSLIGHT_TCXEA5_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEA_RNG*)0xFA012454u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXEA5_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXEA5_RNG.
*/
#define MCDSLIGHT_TCXEARNG5 (MCDSLIGHT_TCXEA5_RNG)

/** \brief 2460, Comparator Bound Register 6 */
#define MCDSLIGHT_TCXEA6_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEA_BND*)0xFA012460u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXEA6_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXEA6_BND.
*/
#define MCDSLIGHT_TCXEABND6 (MCDSLIGHT_TCXEA6_BND)

/** \brief 2464, Comparator Range Register 6 */
#define MCDSLIGHT_TCXEA6_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEA_RNG*)0xFA012464u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXEA6_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXEA6_RNG.
*/
#define MCDSLIGHT_TCXEARNG6 (MCDSLIGHT_TCXEA6_RNG)

/** \brief 2470, Comparator Bound Register 7 */
#define MCDSLIGHT_TCXEA7_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEA_BND*)0xFA012470u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXEA7_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXEA7_BND.
*/
#define MCDSLIGHT_TCXEABND7 (MCDSLIGHT_TCXEA7_BND)

/** \brief 2474, Comparator Range Register 7 */
#define MCDSLIGHT_TCXEA7_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEA_RNG*)0xFA012474u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXEA7_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXEA7_RNG.
*/
#define MCDSLIGHT_TCXEARNG7 (MCDSLIGHT_TCXEA7_RNG)

/** \brief 2480, Comparator Bound Register 0 */
#define MCDSLIGHT_TCXWD0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_BND*)0xFA012480u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD0_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD0_BND.
*/
#define MCDSLIGHT_TCXWDBND0 (MCDSLIGHT_TCXWD0_BND)

/** \brief 2484, Comparator Bound Register 0 */
#define MCDSLIGHT_TCXWD0_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_HBND*)0xFA012484u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD0_HBND.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD0_HBND.
*/
#define MCDSLIGHT_TCXWDHBND0 (MCDSLIGHT_TCXWD0_HBND)

/** \brief 2488, Comparator Range Register 0 */
#define MCDSLIGHT_TCXWD0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_RNG*)0xFA012488u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD0_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD0_RNG.
*/
#define MCDSLIGHT_TCXWDRNG0 (MCDSLIGHT_TCXWD0_RNG)

/** \brief 248C, Comparator Range Register 0 */
#define MCDSLIGHT_TCXWD0_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_HRNG*)0xFA01248Cu)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD0_HRNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD0_HRNG.
*/
#define MCDSLIGHT_TCXWDHRNG0 (MCDSLIGHT_TCXWD0_HRNG)

/** \brief 2490, Comparator Mask Register 0 */
#define MCDSLIGHT_TCXWD0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_MSK*)0xFA012490u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD0_MSK.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD0_MSK.
*/
#define MCDSLIGHT_TCXWDMSK0 (MCDSLIGHT_TCXWD0_MSK)

/** \brief 2494, Comparator Mask Register 0 */
#define MCDSLIGHT_TCXWD0_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_HMSK*)0xFA012494u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD0_HMSK.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD0_HMSK.
*/
#define MCDSLIGHT_TCXWDHMSK0 (MCDSLIGHT_TCXWD0_HMSK)

/** \brief 249C, Comparator Sign Register 0 */
#define MCDSLIGHT_TCXWD0_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_SGN*)0xFA01249Cu)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD0_SGN.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD0_SGN.
*/
#define MCDSLIGHT_TCXWDSGN0 (MCDSLIGHT_TCXWD0_SGN)

/** \brief 24A0, Comparator Bound Register 1 */
#define MCDSLIGHT_TCXWD1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_BND*)0xFA0124A0u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD1_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD1_BND.
*/
#define MCDSLIGHT_TCXWDBND1 (MCDSLIGHT_TCXWD1_BND)

/** \brief 24A4, Comparator Bound Register 1 */
#define MCDSLIGHT_TCXWD1_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_HBND*)0xFA0124A4u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD1_HBND.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD1_HBND.
*/
#define MCDSLIGHT_TCXWDHBND1 (MCDSLIGHT_TCXWD1_HBND)

/** \brief 24A8, Comparator Range Register 1 */
#define MCDSLIGHT_TCXWD1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_RNG*)0xFA0124A8u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD1_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD1_RNG.
*/
#define MCDSLIGHT_TCXWDRNG1 (MCDSLIGHT_TCXWD1_RNG)

/** \brief 24AC, Comparator Range Register 1 */
#define MCDSLIGHT_TCXWD1_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_HRNG*)0xFA0124ACu)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD1_HRNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD1_HRNG.
*/
#define MCDSLIGHT_TCXWDHRNG1 (MCDSLIGHT_TCXWD1_HRNG)

/** \brief 24B0, Comparator Mask Register 1 */
#define MCDSLIGHT_TCXWD1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_MSK*)0xFA0124B0u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD1_MSK.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD1_MSK.
*/
#define MCDSLIGHT_TCXWDMSK1 (MCDSLIGHT_TCXWD1_MSK)

