dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxMcdslight_reg.h
/** \brief 24B4, Comparator Mask Register 1 */
#define MCDSLIGHT_TCXWD1_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_HMSK*)0xFA0124B4u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD1_HMSK.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD1_HMSK.
*/
#define MCDSLIGHT_TCXWDHMSK1 (MCDSLIGHT_TCXWD1_HMSK)

/** \brief 24BC, Comparator Sign Register 1 */
#define MCDSLIGHT_TCXWD1_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_SGN*)0xFA0124BCu)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD1_SGN.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD1_SGN.
*/
#define MCDSLIGHT_TCXWDSGN1 (MCDSLIGHT_TCXWD1_SGN)

/** \brief 24C0, Comparator Bound Register 2 */
#define MCDSLIGHT_TCXWD2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_BND*)0xFA0124C0u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD2_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD2_BND.
*/
#define MCDSLIGHT_TCXWDBND2 (MCDSLIGHT_TCXWD2_BND)

/** \brief 24C4, Comparator Bound Register 2 */
#define MCDSLIGHT_TCXWD2_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_HBND*)0xFA0124C4u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD2_HBND.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD2_HBND.
*/
#define MCDSLIGHT_TCXWDHBND2 (MCDSLIGHT_TCXWD2_HBND)

/** \brief 24C8, Comparator Range Register 2 */
#define MCDSLIGHT_TCXWD2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_RNG*)0xFA0124C8u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD2_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD2_RNG.
*/
#define MCDSLIGHT_TCXWDRNG2 (MCDSLIGHT_TCXWD2_RNG)

/** \brief 24CC, Comparator Range Register 2 */
#define MCDSLIGHT_TCXWD2_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_HRNG*)0xFA0124CCu)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD2_HRNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD2_HRNG.
*/
#define MCDSLIGHT_TCXWDHRNG2 (MCDSLIGHT_TCXWD2_HRNG)

/** \brief 24D0, Comparator Mask Register 2 */
#define MCDSLIGHT_TCXWD2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_MSK*)0xFA0124D0u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD2_MSK.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD2_MSK.
*/
#define MCDSLIGHT_TCXWDMSK2 (MCDSLIGHT_TCXWD2_MSK)

/** \brief 24D4, Comparator Mask Register 2 */
#define MCDSLIGHT_TCXWD2_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_HMSK*)0xFA0124D4u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD2_HMSK.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD2_HMSK.
*/
#define MCDSLIGHT_TCXWDHMSK2 (MCDSLIGHT_TCXWD2_HMSK)

/** \brief 24DC, Comparator Sign Register 2 */
#define MCDSLIGHT_TCXWD2_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_SGN*)0xFA0124DCu)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD2_SGN.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD2_SGN.
*/
#define MCDSLIGHT_TCXWDSGN2 (MCDSLIGHT_TCXWD2_SGN)

/** \brief 24E0, Comparator Bound Register 3 */
#define MCDSLIGHT_TCXWD3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_BND*)0xFA0124E0u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD3_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD3_BND.
*/
#define MCDSLIGHT_TCXWDBND3 (MCDSLIGHT_TCXWD3_BND)

/** \brief 24E4, Comparator Bound Register 3 */
#define MCDSLIGHT_TCXWD3_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_HBND*)0xFA0124E4u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD3_HBND.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD3_HBND.
*/
#define MCDSLIGHT_TCXWDHBND3 (MCDSLIGHT_TCXWD3_HBND)

/** \brief 24E8, Comparator Range Register 3 */
#define MCDSLIGHT_TCXWD3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_RNG*)0xFA0124E8u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD3_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD3_RNG.
*/
#define MCDSLIGHT_TCXWDRNG3 (MCDSLIGHT_TCXWD3_RNG)

/** \brief 24EC, Comparator Range Register 3 */
#define MCDSLIGHT_TCXWD3_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_HRNG*)0xFA0124ECu)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD3_HRNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD3_HRNG.
*/
#define MCDSLIGHT_TCXWDHRNG3 (MCDSLIGHT_TCXWD3_HRNG)

/** \brief 24F0, Comparator Mask Register 3 */
#define MCDSLIGHT_TCXWD3_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_MSK*)0xFA0124F0u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD3_MSK.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD3_MSK.
*/
#define MCDSLIGHT_TCXWDMSK3 (MCDSLIGHT_TCXWD3_MSK)

/** \brief 24F4, Comparator Mask Register 3 */
#define MCDSLIGHT_TCXWD3_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_HMSK*)0xFA0124F4u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD3_HMSK.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD3_HMSK.
*/
#define MCDSLIGHT_TCXWDHMSK3 (MCDSLIGHT_TCXWD3_HMSK)

/** \brief 24FC, Comparator Sign Register 3 */
#define MCDSLIGHT_TCXWD3_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXWD_SGN*)0xFA0124FCu)
/** Alias (User Manual Name) for MCDSLIGHT_TCXWD3_SGN.
* To use register names with standard convension, please use MCDSLIGHT_TCXWD3_SGN.
*/
#define MCDSLIGHT_TCXWDSGN3 (MCDSLIGHT_TCXWD3_SGN)

/** \brief 2500, Comparator Bound Register 0 */
#define MCDSLIGHT_TCXAC0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXAC_BND*)0xFA012500u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXAC0_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXAC0_BND.
*/
#define MCDSLIGHT_TCXACBND0 (MCDSLIGHT_TCXAC0_BND)

/** \brief 2504, Comparator Range Register 0 */
#define MCDSLIGHT_TCXAC0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXAC_RNG*)0xFA012504u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXAC0_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXAC0_RNG.
*/
#define MCDSLIGHT_TCXACRNG0 (MCDSLIGHT_TCXAC0_RNG)

/** \brief 2508, Comparator Mask Register 0 */
#define MCDSLIGHT_TCXAC0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXAC_MSK*)0xFA012508u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXAC0_MSK.
* To use register names with standard convension, please use MCDSLIGHT_TCXAC0_MSK.
*/
#define MCDSLIGHT_TCXACMSK0 (MCDSLIGHT_TCXAC0_MSK)

