dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxMcdslight_reg.h
/** \brief 4200, Lookup Table Data Register */
#define MCDSLIGHT_TCYPALLUTD /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYPALLUTD*)0xFA014200u)

/** \brief 4204, Lookup Table Address Register */
#define MCDSLIGHT_TCYPALLUTA /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYPALLUTA*)0xFA014204u)

/** \brief 4210, Lookup Table Base Register */
#define MCDSLIGHT_TCYPAL0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYPAL_BND*)0xFA014210u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYPAL0_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYPAL0_BND.
*/
#define MCDSLIGHT_TCYPALBND0 (MCDSLIGHT_TCYPAL0_BND)

/** \brief 4214, Lookup Table Range Register */
#define MCDSLIGHT_TCYPAL0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYPAL_RNG*)0xFA014214u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYPAL0_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYPAL0_RNG.
*/
#define MCDSLIGHT_TCYPALRNG0 (MCDSLIGHT_TCYPAL0_RNG)

/** \brief 4218, Lookup Table Mapping Register */
#define MCDSLIGHT_TCYPAL0_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYPAL_MAP*)0xFA014218u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYPAL0_MAP.
* To use register names with standard convension, please use MCDSLIGHT_TCYPAL0_MAP.
*/
#define MCDSLIGHT_TCYPALMAP0 (MCDSLIGHT_TCYPAL0_MAP)

/** \brief 4220, Lookup Table Base Register */
#define MCDSLIGHT_TCYPAL1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYPAL_BND*)0xFA014220u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYPAL1_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYPAL1_BND.
*/
#define MCDSLIGHT_TCYPALBND1 (MCDSLIGHT_TCYPAL1_BND)

/** \brief 4224, Lookup Table Range Register */
#define MCDSLIGHT_TCYPAL1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYPAL_RNG*)0xFA014224u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYPAL1_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYPAL1_RNG.
*/
#define MCDSLIGHT_TCYPALRNG1 (MCDSLIGHT_TCYPAL1_RNG)

/** \brief 4228, Lookup Table Mapping Register */
#define MCDSLIGHT_TCYPAL1_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYPAL_MAP*)0xFA014228u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYPAL1_MAP.
* To use register names with standard convension, please use MCDSLIGHT_TCYPAL1_MAP.
*/
#define MCDSLIGHT_TCYPALMAP1 (MCDSLIGHT_TCYPAL1_MAP)

/** \brief 4230, Lookup Table Base Register */
#define MCDSLIGHT_TCYPAL2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYPAL_BND*)0xFA014230u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYPAL2_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYPAL2_BND.
*/
#define MCDSLIGHT_TCYPALBND2 (MCDSLIGHT_TCYPAL2_BND)

/** \brief 4234, Lookup Table Range Register */
#define MCDSLIGHT_TCYPAL2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYPAL_RNG*)0xFA014234u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYPAL2_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYPAL2_RNG.
*/
#define MCDSLIGHT_TCYPALRNG2 (MCDSLIGHT_TCYPAL2_RNG)

/** \brief 4238, Lookup Table Mapping Register */
#define MCDSLIGHT_TCYPAL2_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYPAL_MAP*)0xFA014238u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYPAL2_MAP.
* To use register names with standard convension, please use MCDSLIGHT_TCYPAL2_MAP.
*/
#define MCDSLIGHT_TCYPALMAP2 (MCDSLIGHT_TCYPAL2_MAP)

/** \brief 4240, Lookup Table Base Register */
#define MCDSLIGHT_TCYPAL3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYPAL_BND*)0xFA014240u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYPAL3_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYPAL3_BND.
*/
#define MCDSLIGHT_TCYPALBND3 (MCDSLIGHT_TCYPAL3_BND)

/** \brief 4244, Lookup Table Range Register */
#define MCDSLIGHT_TCYPAL3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYPAL_RNG*)0xFA014244u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYPAL3_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYPAL3_RNG.
*/
#define MCDSLIGHT_TCYPALRNG3 (MCDSLIGHT_TCYPAL3_RNG)

/** \brief 4248, Lookup Table Mapping Register */
#define MCDSLIGHT_TCYPAL3_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYPAL_MAP*)0xFA014248u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYPAL3_MAP.
* To use register names with standard convension, please use MCDSLIGHT_TCYPAL3_MAP.
*/
#define MCDSLIGHT_TCYPALMAP3 (MCDSLIGHT_TCYPAL3_MAP)

/** \brief 4400, Comparator Bound Register 0 */
#define MCDSLIGHT_TCYEA0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEA_BND*)0xFA014400u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYEA0_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYEA0_BND.
*/
#define MCDSLIGHT_TCYEABND0 (MCDSLIGHT_TCYEA0_BND)

/** \brief 4404, Comparator Range Register 0 */
#define MCDSLIGHT_TCYEA0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEA_RNG*)0xFA014404u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYEA0_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYEA0_RNG.
*/
#define MCDSLIGHT_TCYEARNG0 (MCDSLIGHT_TCYEA0_RNG)

/** \brief 4410, Comparator Bound Register 1 */
#define MCDSLIGHT_TCYEA1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEA_BND*)0xFA014410u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYEA1_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYEA1_BND.
*/
#define MCDSLIGHT_TCYEABND1 (MCDSLIGHT_TCYEA1_BND)

/** \brief 4414, Comparator Range Register 1 */
#define MCDSLIGHT_TCYEA1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEA_RNG*)0xFA014414u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYEA1_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYEA1_RNG.
*/
#define MCDSLIGHT_TCYEARNG1 (MCDSLIGHT_TCYEA1_RNG)

/** \brief 4420, Comparator Bound Register 2 */
#define MCDSLIGHT_TCYEA2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEA_BND*)0xFA014420u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYEA2_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYEA2_BND.
*/
#define MCDSLIGHT_TCYEABND2 (MCDSLIGHT_TCYEA2_BND)

/** \brief 4424, Comparator Range Register 2 */
#define MCDSLIGHT_TCYEA2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEA_RNG*)0xFA014424u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYEA2_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYEA2_RNG.
*/
#define MCDSLIGHT_TCYEARNG2 (MCDSLIGHT_TCYEA2_RNG)

/** \brief 4430, Comparator Bound Register 3 */
#define MCDSLIGHT_TCYEA3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEA_BND*)0xFA014430u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYEA3_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYEA3_BND.
*/
#define MCDSLIGHT_TCYEABND3 (MCDSLIGHT_TCYEA3_BND)

/** \brief 4434, Comparator Range Register 3 */
#define MCDSLIGHT_TCYEA3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEA_RNG*)0xFA014434u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYEA3_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYEA3_RNG.
*/
#define MCDSLIGHT_TCYEARNG3 (MCDSLIGHT_TCYEA3_RNG)

